////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА Сервере

&НаСервере
Процедура УстановитьОтбор()
	
	//ПолеОтбора = Новый ПолеКомпоновкиДанных("Владелец");
	//
	//ЕстьОтбор = Ложь;
	//Для Каждого ЭлементОтбора Из дсЗначенияАналитики.Отбор.Элементы Цикл
	//	Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора Тогда
	//		ЕстьОтбор = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;	
	//	
	//
	//Если Не ЕстьОтбор Тогда
	//	ЭлементОтбора = дсЗначенияАналитики.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение 	= ПолеОтбора;
	//КонецЕсли;
	//
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	//ЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Сервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	КоличествоСвойств = ЭД_ОбщегоНазначения.ПолучитьКоличествоСвойств();
	
	Для Ин = 1 По КоличествоСвойств Цикл
		Если ЗначениеЗаполнено(Объект["ИмяСвойства" + Ин]) И Не ЗначениеЗаполнено(Объект["ТипСвойства" + Ин]) Тогда
	        Сообщение = Новый СообщениеПользователю();
	        Сообщение.Текст = "Не заполнен тип свойства";
	        Сообщение.Поле = "Объект.ТипСвойства" + Ин;
	        Сообщение.УстановитьДанные(Объект["ИмяСвойства" + Ин]);
	        Сообщение.Сообщить();
	        Отказ = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьАналитику(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда   		
		Сообщить("Предварительно необходимо записать справочник.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;	
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ (НА Клиенте)

&НаКлиенте
Процедура дсАналитикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Элемент.ДополнительныеПараметрыСоздания = Новый ФиксированнаяСтруктура("ТипАналитики", Объект.Ссылка);  	
	
КонецПроцедуры
