Процедура ПроверитьУникальностьАналитик(Отказ)
	
	тзАналитики = Аналитики.Выгрузить();
	тзАналитики.Колонки.Добавить("Количество");
	тзАналитики.ЗаполнитьЗначения(1, "Количество");
	тзАналитики.Свернуть("Аналитика", "Количество");
	
	Для Каждого Строка Из тзАналитики Цикл
		
		Если Строка.Количество > 1 Тогда 
			Отказ = Истина;
			Сообщить("Аналитика """ + Строка.Аналитика + """ указана несколько раз. Аналитики должны быть уникальными в пределах строки.", СтатусСообщения.Важное);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьНаличиеАналитикиВМодели(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭД_МодельРеквизитыДокумента.Реквизит.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	Справочник.ЭД_Модель.РеквизитыДокумента КАК ЭД_МодельРеквизитыДокумента
		|ГДЕ
		|	ЭД_МодельРеквизитыДокумента.Реквизит В(&Аналитики)
		|	И ЭД_МодельРеквизитыДокумента.Ссылка = &Модель";
	
	Запрос.УстановитьПараметр("Аналитики",	Аналитики.ВыгрузитьКолонку("Аналитика"));
	Запрос.УстановитьПараметр("Модель", 	Ссылка.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Отказ = Выборка.Количество() > 0;
	
	Пока Выборка.Следующий() Цикл
		Сообщить("В реквизитах модели уже используется аналитика """ + Выборка.ПредставлениеРеквизита + """."); 
	КонецЦикла; 	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;    	
	
	ПроверитьУникальностьАналитик(Отказ);
	ПроверитьНаличиеАналитикиВМодели(Отказ);
	
	Если Не Отказ Тогда
	
		СоставАналитик = "";
		Для Каждого ТекСтрока Из ЭтотОбъект.Аналитики Цикл
			
			СоставАналитик = СоставАналитик + ТекСтрока.Аналитика.Наименование + ", ";
			
		КонецЦикла;
		СоставАналитик = Лев(СоставАналитик, СтрДлина(СоставАналитик)-2);
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "С";
	
КонецПроцедуры
