
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбработкаПерехода(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СправочникиНажатие(Элемент)
	ОбработкаПерехода(ЭтотОбъект, Элемент);			
КонецПроцедуры

&НаКлиенте
Процедура ПодготовкаОтчетностиНажатие(Элемент)
	ОткрытьФорму("Документ.ЭД_ЭлектронныйДокумент.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Справочники_ВалютыНажатие(Элемент)
	ОбработкаОткрытияФормы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Справочники_ОрганизацииНажатие(Элемент)
	ОбработкаОткрытияФормы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Справочники_КредитныеОрганизацииНажатие(Элемент)
	ОбработкаОткрытияФормы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Справочники_ФинансовыеСделкиНажатие(Элемент)
	ОбработкаОткрытияФормы(Элемент);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработкаПерехода(Форма, Элемент = Неопределено)
	
	Элементы = Форма.Элементы;
		
	ИмяГруппыЭлементов = СтрШаблон(
		"Группа%1", 
		?(Элемент = Неопределено, "Подсистемы", Элемент.Имя));
	Для Каждого ЭлементФормы Из Элементы Цикл
		
		Если ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, ЭлементФормы.Имя, "Видимость", ЭлементФормы.Имя = ИмяГруппыЭлементов);	
				
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОткрытияФормы(Элемент)
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Элемент.Имя, "_");
	Если Массив.Количество() < 3 Тогда
		Возврат;	
	КонецЕсли;
	          
	ОткрытьФорму(СтрШаблон("%1.%2.%3", Массив[0], Массив[1], Массив[2]), , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяСтраница(Команда)
	ОбработкаПерехода(ЭтотОбъект);
КонецПроцедуры
