
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьСписокДокументов();
КонецПроцедуры


&НаСервере
Процедура СформироватьСписокДокументов()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЭД_ФайлыЭлектронныхДокументов.Ссылка КАК Ссылка,
	               |	ЭД_ФайлыЭлектронныхДокументов.ВерсияДанных КАК ВерсияДанных,
	               |	ЭД_ФайлыЭлектронныхДокументов.ПометкаУдаления КАК ПометкаУдаления,
	               |	ЭД_ФайлыЭлектронныхДокументов.Код КАК Код,
	               |	ЭД_ФайлыЭлектронныхДокументов.Наименование КАК Наименование,
	               |	ЭД_ФайлыЭлектронныхДокументов.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	               |	ЭД_ФайлыЭлектронныхДокументов.МакетИмпорта КАК МакетИмпорта,
	               |	ЭД_ФайлыЭлектронныхДокументов.Расширение КАК Расширение,
	               |	ЭД_ФайлыЭлектронныхДокументов.Предопределенный КАК Предопределенный,
	               |	ЭД_ФайлыЭлектронныхДокументов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.ЭД_ФайлыЭлектронныхДокументов КАК ЭД_ФайлыЭлектронныхДокументов";
	
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("Куратор") Тогда
		ТекстЗапроса = ТекстЗапроса + "
							|	ГДЕ
							|	ЭД_ФайлыЭлектронныхДокументов.ЭлектронныйДокумент.РеквизитыДокумента.ЗначениеРеквизита = &ЗначениеРеквизита";
	КонецЕсли;
	
	
	Если РольДоступна("ПользовательРегиона") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиГруппыДоступа.ГруппаДоступа КАК ГруппаДоступа
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	Справочник.Пользователи.ГруппыДоступа КАК ПользователиГруппыДоступа
		|ГДЕ
		|	ПользователиГруппыДоступа.Ссылка = &Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	ПользователиГруппыДоступа.ГруппаДоступа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭД_ГруппыДоступаМодели.МодельЭД КАК МодельЭД
		|ИЗ
		|	Справочник.ЭД_ГруппыДоступа.Модели КАК ЭД_ГруппыДоступаМодели
		|ГДЕ
		|	ЭД_ГруппыДоступаМодели.Ссылка В
		|			(ВЫБРАТЬ
		|				Таб.ГруппаДоступа
		|			ИЗ
		|				Данные КАК Таб)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭД_ГруппыДоступаМодели.МодельЭД";

		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		СписокМоделей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МодельЭД");
		
		Если СтрНайти(ТекстЗапроса, "&ЗначениеРеквизита") <> 0 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И ЭД_ФайлыЭлектронныхДокументов.ЭлектронныйДокумент.МодельЭД В (&СписокМоделей)";	
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|	ГДЕ
			|	ЭД_ФайлыЭлектронныхДокументов.ЭлектронныйДокумент.МодельЭД В (&СписокМоделей)";	
		КонецЕсли;

	КонецЕсли;
	
	
	Список.ТекстЗапроса = ТекстЗапроса; 
	
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("Куратор") Тогда
		ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ТекПользователь.УникальныйИдентификатор);
		Список.Параметры.УстановитьЗначениеПараметра("ЗначениеРеквизита", Пользователь.Регион);
	КонецЕсли;
	Если РольДоступна("ПользовательРегиона") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СписокМоделей", СписокМоделей);
	КонецЕсли;
	
	
КонецПроцедуры