&НаКлиенте
Процедура ИзменитьСвойства(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	ПолеПоиск = Новый ПолеКомпоновкиДанных("Владелец");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.Использование И Эл.ЛевоеЗначение = ПолеПоиск Тогда
			СтруктураПараметров.Вставить("МодельЭД", Эл.ПравоеЗначение);
		КонецЕсли;	
	КонецЦикла;		
	
	сзПоказатели = Новый СписокЗначений;
	сзПоказатели.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	
	СтруктураПараметров.Вставить("сзПоказатели", сзПоказатели);
	
	Форма = ОткрытьФорму("ОбщаяФорма.ЭД_ФормаРедактированияРеквизитов", СтруктураПараметров);	
	
КонецПроцедуры
