
Процедура ПроверитьСуществованиеПериода(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭД_ЗначенияАналитик.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭД_ЗначенияАналитик КАК ЭД_ЗначенияАналитик
		|ГДЕ
		|	ЭД_ЗначенияАналитик.Ссылка <> &Ссылка
		|	И ЭД_ЗначенияАналитик.ДатаНачала = &ДатаНачала
		|	И ЭД_ЗначенияАналитик.ДатаОкончания = &ДатаОкончания
		|	И ЭД_ЗначенияАналитик.Периодичность = &Периодичность";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	Запрос.УстановитьПараметр("Периодичность", 	Периодичность);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ = Истина;
		Сообщить("Уже существует период с реквизитами: Дата начала = """ + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + """, Дата окончания = """ + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy") + """, Периодичность = """ + Периодичность + """."); 			
	КонецЕсли;
	
КонецПроцедуры	


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Владелец = ПланыВидовХарактеристик.ЭД_ТипыАналитик.Периоды Тогда
		ПроверитьСуществованиеПериода(Отказ);  	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда Отка=Истина; КонецЕсли;
	
	ПолноеНаименование = Наименование;
	
КонецПроцедуры
