&НаСервере
Процедура УстановитьОтбор(ИмяПоляОтбора, ЗначениеОтбора)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоляОтбора);  
	ЭлементОтбора = Неопределено;
	
	Для Каждого ЭлОтбор Из Список.Отбор.Элементы Цикл
		Если ЭлОтбор.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = ЭлОтбор;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	КонецЕсли;	
	ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ЗначениеОтбора;
	ЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимость()
	
	Если Элементы.Справочники.ТекущаяСтрока = ПланыВидовХарактеристик.ЭД_ТипыАналитик.Периоды Тогда
		Элементы.СписокСоздатьПериоды.Видимость = Истина;
	Иначе	
		Элементы.СписокСоздатьПериоды.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Элементы.Справочники.ТекущаяСтрока = Параметры.Отбор.Владелец;
	КонецЕсли;	 	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ТипыАналитикПриАктивизацииСтроки(Элемент)
	    	
	УстановитьОтбор("Владелец", Элементы.Справочники.ТекущаяСтрока);
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПериоды(Команда)
	
	Форма = ПолучитьФорму("ОбщаяФорма.ЭД_ФормаСозданияПериодов", Новый Структура("ИсходныйПериод", Элементы.Список.ТекущаяСтрока));
	
	Форма.Открыть();
	
КонецПроцедуры

