
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура") Тогда
		Если Параметры.ДополнительныеПараметры.Свойство("Владелец") Тогда
			
			Объект.Владелец = Параметры.ДополнительныеПараметры.Владелец;
			
		КонецЕсли;
	КонецЕсли;	     	
	
	АналитикиМодели.ЗагрузитьЗначения(Объект.Владелец.РеквизитыДокумента.ВыгрузитьКолонку("Реквизит"));
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиРеквизитАналитикиДляСортировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить("Код");
	ДанныеВыбора.Добавить("Наименование");
	
КонецПроцедуры
