
&НаКлиенте
Процедура ЗагрузитьБанкиИзЦБ(Команда)
	
	ЗагрузитьБанкиИзЦБНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьБанкиИзЦБНаСервере()
	
	Если Метаданные.Обработки.Найти("ЗагрузкаКлассификатораБанков") <> Неопределено Тогда
		Обработки["ЗагрузкаКлассификатораБанков"].ЗагрузитьКлассификаторыБанковЦБИзФайла();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
