
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ИмяФайла = ПолучитьИмяВременногоФайла(ПолучитьРасширениеНаСервере());
	ДвоичныеДанные = ПолучитьФайлИзРегистра();
	Если ДвоичныеДанные <> Неопределено Тогда
		ДвоичныеДанные.Записать(ИмяФайла);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяФайла", ИмяФайла);
		Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект, ДополнительныеПараметры);
		НачатьЗапускПриложения(Оповещение, ИмяФайла, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасширениеНаСервере()
	
	Возврат Объект.Владелец.Расширение;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлИзРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭД_ХранилищеВерсийФайловЭД.ХранимыйФайл КАК ХранимыйФайл
	|ИЗ
	|	РегистрСведений.ЭД_ХранилищеВерсийФайловЭД КАК ЭД_ХранилищеВерсийФайловЭД
	|ГДЕ
	|	ЭД_ХранилищеВерсийФайловЭД.Версия = &Версия";
	Запрос.УстановитьПараметр("Версия", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ХранимыйФайл.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
	
	НовоеОповещение = Новый ОписаниеОповещения("ПослеУдаленияФайлов", ЭтотОбъект, ДополнительныйПараметр);
	
	НачатьУдалениеФайлов(НовоеОповещение, ДополнительныйПараметр.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияФайлов(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры