////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА СервереБезКонтеста

&НаСервереБезКонтекста
Функция ПолучитьСтароеЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];

КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА Сервере


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Сервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура") Тогда
		Если Параметры.ДополнительныеПараметры.Свойство("Владелец") Тогда
			
			Объект.Владелец = Параметры.ДополнительныеПараметры.Владелец;
			
		КонецЕсли;
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.КолонкаЭД) И Объект.КолонкаЭД <> ТекущийОбъект.КолонкаЭД Тогда
		ТекущийОбъект.Длина 			= ТекущийОбъект.КолонкаЭД.Длина;
		ТекущийОбъект.Точность 			= ТекущийОбъект.КолонкаЭД.Точность;
		ТекущийОбъект.НеМасштабируется 	= ТекущийОбъект.КолонкаЭД.НеМасштабируется;
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Клиенте


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	///___мкском___Козлов Иван Витальевич___2020/08/10___№№.№№___1 
	
	ТипЗначенияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.КолонкаЭД <> ПолучитьСтароеЗначениеРеквизита(Объект.Ссылка, "КолонкаЭД") Тогда
			
		Если Вопрос("Свойства ""Длина"", ""Точность"", ""Не масштабируется"" будут установлены в соответствии со свойствами новой колонки. Продложить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;	
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	///___мкском___Козлов Иван Витальевич___2020/08/07___№№.№№___1
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ЭД_ТипыЗначений.Число") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ТипЗначения) 
		Тогда
		
		Элементы.Длина.Видимость = Истина;
		Элементы.Точность.Видимость = Истина;
	Иначе
		Элементы.Длина.Видимость = Ложь;
		Элементы.Точность.Видимость = Ложь;
	КонецЕсли; 	
КонецПроцедуры


