////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ НА Клиенте

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА СервереБезКонтеста

&НаСервереБезКонтекста
Функция ПолучитьСтароеЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];

КонецФункции	

&НаСервереБезКонтекста
Функция ЕстьПоказатели(Колонка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭД_Показатели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭД_Показатели КАК ЭД_Показатели
	|ГДЕ
	|	ЭД_Показатели.КолонкаЭД = &Колонка
	|//	И НЕ ЭД_Показатели.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Колонка", 	Колонка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();    	
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ИзменитьПоказатели(ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭД_Показатели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭД_Показатели КАК ЭД_Показатели
	|ГДЕ
	|	ЭД_Показатели.КолонкаЭД = &Колонка
	|//	И НЕ ЭД_Показатели.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Колонка", 	ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИзмененныеПоказатели = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПоказательОб = Выборка.Ссылка.ПолучитьОбъект();
		ПоказательОб.Длина 				= ТекущийОбъект.Длина;
		ПоказательОб.Точность 			= ТекущийОбъект.Точность;
		ПоказательОб.НеМасштабируется 	= ТекущийОбъект.НеМасштабируется;
		ПоказательОб.Записать();
		
		ИзмененныеПоказатели.Добавить(ПоказательОб.Ссылка);
		
	КонецЦикла;	
	
	ПараметрыЗаписи.Вставить("ИзмененныеПоказатели",	ИзмененныеПоказатели);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ ВЫПОЛНЯЕМЫЕ НА Сервере

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Сервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура") Тогда
		Если Параметры.ДополнительныеПараметры.Свойство("Владелец") Тогда
			
			Объект.Владелец = Параметры.ДополнительныеПараметры.Владелец;
			
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СпособАгрегации = Перечисления.ЭД_СпособАгрегацииЗначений.Сумма;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийОбъект.ЭтоНовый() Тогда
	
		ИзменитьПоказатели(ТекущийОбъект, ПараметрыЗаписи);
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА Клиенте

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	///___мкском___Козлов Иван Витальевич___2020/08/10___№№.№№___1 
	
	ТипЗначенияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Длина <> ПолучитьСтароеЗначениеРеквизита(Объект.Ссылка, "Длина") Или Объект.Точность <> ПолучитьСтароеЗначениеРеквизита(Объект.Ссылка, "Точность") Или Объект.НеМасштабируется <> ПолучитьСтароеЗначениеРеквизита(Объект.Ссылка, "НеМасштабируется") Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) И ЕстьПоказатели(Объект.Ссылка) Тогда
		
			Если Вопрос("Свойства колонки (""Длина"", ""Точность"", ""Не масштабируется"") будут установлены у всех показателей, относящихся к данной колонке. Продложить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;	
				Возврат;
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ИзмененныеПоказатели") Тогда
		Для Каждого Показ Из ПараметрыЗаписи.ИзмененныеПоказатели Цикл
			ОповеститьОбИзменении(Показ);
		КонецЦикла;	     	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	///___мкском___Козлов Иван Витальевич___2020/08/07___№№.№№___1 
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ЭД_ТипыЗначений.Число") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ТипЗначения) 
		Тогда
		
		Элементы.Длина.Видимость = Истина;
		Элементы.Точность.Видимость = Истина;	
		Элементы.ДлинаСтроки.Видимость = Ложь;
	Иначе
		Элементы.Длина.Видимость = Ложь;
		Элементы.Точность.Видимость = Ложь;
		
		Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ЭД_ТипыЗначений.Строка")  Тогда
			
			Элементы.ДлинаСтроки.Видимость = Истина;	
		Иначе
			Элементы.ДлинаСтроки.Видимость = Ложь;	
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

